### **ノック21：データを読み込んで把握しよう**

In [1]:
import pandas as pd

In [2]:
#4種類のデータを読み込む
use_log = pd.read_csv(r'C:\Users\pub-k\Documents\Python\Practical_data_analysis_100_knocks\Data\第3章\use_log.csv')
customer_master = pd.read_csv(r'C:\Users\pub-k\Documents\Python\Practical_data_analysis_100_knocks\Data\第3章\customer_master.csv')
campaign_master = pd.read_csv(r'C:\Users\pub-k\Documents\Python\Practical_data_analysis_100_knocks\Data\第3章\campaign_master.csv')
class_master = pd.read_csv(r'C:\Users\pub-k\Documents\Python\Practical_data_analysis_100_knocks\Data\第3章\class_master.csv')

In [3]:
#結果を表示
print(len(use_log))
use_log.head()

197428

            log_id customer_id     usedate
0  L00000049012330    AS009373  2018-04-01
1  L00000049012331    AS015315  2018-04-01
2  L00000049012332    AS040841  2018-04-01
3  L00000049012333    AS046594  2018-04-01
4  L00000049012334    AS073285  2018-04-01

In [4]:
#結果を表示
print(len(customer_master))
customer_master.head()

4192

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0

In [5]:
#結果を表示
print(len(campaign_master))
campaign_master.head()

3

  campaign_id campaign_name
0         CA1            通常
1         CA2         入会費半額
2         CA3         入会費無料

In [6]:
#結果を表示
print(len(class_master))
class_master.head()

3

  class class_name  price
0   C01     オールタイム  10500
1   C02      デイタイム   7500
2   C03        ナイト   6000

### **ノック22：顧客データを整形しよう**

In [7]:
#customer_masterとcampaign_masterを結合(ジョイン)
customer_data = pd.merge(customer_master, campaign_master, on='campaign_id', how='left')
customer_data = pd.merge(customer_data, class_master, on='class', how='left')

In [8]:
#結果を表示
print(len(customer_data))
customer_data.head()

4192

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,campaign_name,class_name,price
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,通常,オールタイム,10500
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,通常,オールタイム,10500
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,通常,オールタイム,10500
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,通常,オールタイム,10500
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0,通常,ナイト,6000

In [10]:
#欠損値を確認
print(customer_data.isnull().sum())

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
campaign_name       0
class_name          0
price               0
dtype: int64

### **ノック23：顧客データの基礎集計をしよう**

In [15]:
#会員区分の割合を確認
print(customer_data.groupby('class_name').count()['customer_id'])

class_name
オールタイム    2045
デイタイム     1019
ナイト       1128
Name: customer_id, dtype: int64

In [17]:
#入会キャンペーン区分の割合を確認
print(customer_data.groupby('campaign_name').count()['customer_id'])

campaign_name
入会費半額     650
入会費無料     492
通常       3050
Name: customer_id, dtype: int64

In [19]:
#性別区分の割合を確認
print(customer_data.groupby('gender').count()['customer_id'])

gender
F    1983
M    2209
Name: customer_id, dtype: int64

In [20]:
#既に退会かの割合を確認
print(customer_data.groupby('is_deleted').count()['customer_id'])

is_deleted
0    2842
1    1350
Name: customer_id, dtype: int64

In [22]:
#入会人数を集計
customer_data['start_date'] = pd.to_datetime(customer_data['start_date'])
customer_start = customer_data.loc[customer_data['start_date'] > pd.to_datetime("20180401")]

In [23]:
#結果を表示
print(len(customer_start))

1361

### **ノック24：最新顧客データの基礎集計をしてみよう**

In [24]:
#最新月に在籍しているユーザに絞り込む
customer_data['end_date'] = pd.to_datetime(customer_data['end_date'])
customer_newer = customer_data.loc[(customer_data['end_date'] >= pd.to_datetime("20190331")) | customer_data['end_date'].isna()]

In [26]:
#結果を表示
print(len(customer_newer))
print(customer_newer['end_date'].unique())

2953
<DatetimeArray>
['NaT', '2019-03-31 00:00:00']
Length: 2, dtype: datetime64[ns]

In [27]:
#会員区分の割合を確認
print(customer_newer.groupby('class_name').count()['customer_id'])

class_name
オールタイム    1444
デイタイム      696
ナイト        813
Name: customer_id, dtype: int64

In [30]:
#入会キャンペーン区分の割合を確認
print(customer_newer.groupby('campaign_name').count()['customer_id'])

campaign_name
入会費半額     311
入会費無料     242
通常       2400
Name: customer_id, dtype: int64

In [31]:
#性別区分の割合を確認
print(customer_newer.groupby('gender').count()['customer_id'])

gender
F    1400
M    1553
Name: customer_id, dtype: int64

In [32]:
#既に退会かの割合を確認
print(customer_newer.groupby('is_deleted').count()['customer_id'])

is_deleted
0    2842
1     111
Name: customer_id, dtype: int64

### **ノック25：利用履歴データを集計しよう**

In [54]:
#customer_idごとの利用履歴データを作成
use_log['usedate'] = pd.to_datetime(use_log['usedate'])
use_log['年月'] = use_log['usedate'].dt.strftime('%Y%m')
uselog_month = use_log.groupby(['年月', 'customer_id'], as_index=False).count()
uselog_month.rename(columns={'log_id': 'count'}, inplace=True)
del uselog_month['usedate']

In [55]:
#結果を表示
uselog_month.head()

       年月 customer_id  count
0  201804    AS002855      4
1  201804    AS009013      2
2  201804    AS009373      3
3  201804    AS015315      6
4  201804    AS015739      7

In [56]:
uselog_month.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36842 entries, 0 to 36841
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   年月           36842 non-null  object
 1   customer_id  36842 non-null  object
 2   count        36842 non-null  int64
dtypes: int64(1), object(2)
memory usage: 863.6+ KB

In [57]:
#平均値、中央値、最大値、最小値を集計
del uselog_month['年月']
uselog_customer = uselog_month.groupby('customer_id').agg(['mean', 'median', 'max', 'min'])['count']
uselog_customer = uselog_customer.reset_index(drop=False)

In [58]:
#結果を表示
uselog_customer.head()

  customer_id      mean  median  max  min
0    AS002855  4.500000     5.0    7    2
1    AS008805  4.000000     4.0    8    1
2    AS009013  2.000000     2.0    2    2
3    AS009373  5.083333     5.0    7    3
4    AS015233  7.545455     7.0   11    4

### **ノック26：利用履歴データから定期利用フラグを作成しよう**

In [59]:
#月/曜日別に集計
use_log['weekday'] = use_log['usedate'].dt.weekday
uselog_weekday = use_log.groupby(['customer_id', '年月', 'weekday'], as_index=False).count()[['customer_id', '年月', 'weekday', 'log_id']]
uselog_weekday.rename(columns={'log_id': 'count'}, inplace=True)

In [62]:
#結果を表示
uselog_weekday.info()
uselog_weekday.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93333 entries, 0 to 93332
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  93333 non-null  object
 1   年月           93333 non-null  object
 2   weekday      93333 non-null  int32
 3   count        93333 non-null  int64
dtypes: int32(1), int64(1), object(2)
memory usage: 2.5+ MB

  customer_id      年月  weekday  count
0    AS002855  201804        5      4
1    AS002855  201805        2      1
2    AS002855  201805        5      4
3    AS002855  201806        5      5
4    AS002855  201807        1      1

In [63]:
#定期利用フラグを作成
del uselog_weekday['年月']
uselog_weekday = uselog_weekday.groupby('customer_id', as_index=False).max()[['customer_id', 'count']]
uselog_weekday['routine_flg'] = 0
uselog_weekday['routine_flg'] = uselog_weekday['routine_flg'].where(uselog_weekday['count'] < 4, 1)

In [64]:
#結果を表示
uselog_weekday.head()

  customer_id  count  routine_flg
0    AS002855      5            1
1    AS008805      4            1
2    AS009013      2            0
3    AS009373      5            1
4    AS015233      5            1

### **ノック27：顧客データと利用履歴データを結合しよう**

In [65]:
#customer_dataとuselog_customerを結合(ジョイン)
customer_data = pd.merge(customer_data, uselog_customer, on='customer_id', how='left')

In [66]:
#customer_dataとuselog_weekdayを結合(ジョイン)
customer_data = pd.merge(customer_data, uselog_weekday, on='customer_id', how='left')

In [67]:
#結果を表示
customer_data.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,campaign_name,class_name,price,mean,median,max,min,count,routine_flg
0,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,4.833333,5.0,8,2,4,1
1,PL270116,XXXXX,C01,M,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,5.083333,5.0,7,3,5,1
2,OA974876,XXXXX,C01,M,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,4.583333,5.0,6,3,5,1
3,HD024127,XXXXX,C01,F,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,4.833333,4.5,7,2,5,1
4,HD661448,XXXXX,C03,F,2015-05-01,NaT,CA1,0,通常,ナイト,6000,3.916667,4.0,6,1,5,1

In [68]:
#欠損値を確認
customer_data.isnull().sum()

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
campaign_name       0
class_name          0
price               0
mean                0
median              0
max                 0
min                 0
count               0
routine_flg         0
dtype: int64

### **ノック28：会員期間を計算しよう**

In [69]:
#会員期間を計算
from dateutil.relativedelta import relativedelta

customer_data['calc_date'] = customer_data['end_date']
customer_data['calc_date'] = customer_data['calc_date'].fillna(pd.to_datetime("20190430"))

customer_data['membership_period'] = 0
for i in range(len(customer_data)):
    delta = relativedelta(customer_data['calc_date'].iloc[i], customer_data['start_date'].iloc[i])
    customer_data.loc[i, 'membership_period'] = delta.years*12 + delta.months

In [70]:
#結果を表示
customer_data.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,campaign_name,class_name,price,mean,median,max,min,count,routine_flg,calc_date,membership_period
0,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,4.833333,5.0,8,2,4,1,2019-04-30,47
1,PL270116,XXXXX,C01,M,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,5.083333,5.0,7,3,5,1,2019-04-30,47
2,OA974876,XXXXX,C01,M,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,4.583333,5.0,6,3,5,1,2019-04-30,47
3,HD024127,XXXXX,C01,F,2015-05-01,NaT,CA1,0,通常,オールタイム,10500,4.833333,4.5,7,2,5,1,2019-04-30,47
4,HD661448,XXXXX,C03,F,2015-05-01,NaT,CA1,0,通常,ナイト,6000,3.916667,4.0,6,1,5,1,2019-04-30,47

### **ノック29：顧客行動の各種統計量を把握しよう**

In [71]:
customer_data[['mean', 'median', 'max', 'min']].describe()

              mean       median          max          min
count  4192.000000  4192.000000  4192.000000  4192.000000
mean      5.333127     5.250596     7.823950     3.041269
std       1.777533     1.874874     2.168959     1.951565
min       1.000000     1.000000     1.000000     1.000000
25%       4.250000     4.000000     7.000000     2.000000
50%       5.000000     5.000000     8.000000     3.000000
75%       6.416667     6.500000     9.000000     4.000000
max      12.000000    12.000000    14.000000    12.000000